#Задачи на циклы и оператор условия------
#----------------------------------------
print ('НАЧАЛО')
'''
Задача 1
Вывести на экран циклом пять строк из нулей длиной 4, причем каждая строка должна быть пронумерована.
Пример:
    0 0000
    1 0000
    2 0000
    3 0000
....
'''
list0 = ['0000']
list1 =list0 * 5
print(list0)
print(list1)
k = 0
for i in list1 :
    k = k + 1
    print(k,i)

'''
Задача 2
Пользователь в цикле вводит 10 производных цифр. Выведите количество введеных пользователем цифр 5.
'''
N = 10
numbers5 = 0
числа = []
for i in range(N):
    print('Введите число №',i+1, 'из 10-ти')
    k = int(input())
    числа.append(k)
    print(i,k)
    if k == 5 : numbers5 = numbers5 + 1

print('количество введеных пользователем цифр 5  = ', numbers5)
print('были введены следующие числа \n ', числа)

'''
Задача 3
Вывести сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''
sum = 0
for i in range(1,101) :
    sum = sum + i
print(' сумма = ', sum)


'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран(можно поискать в интернете алгоритм факториала в python).
'''
mul = 1
N = 10
for i in range(1,N+1) :
    mul = mul * i
print(' произведение = ', mul)

'''
(!!!Подсказка на следующую задачу - превратите число в строку, а потом работайте с строкой)
Задача 5
Вывести цифры числа на каждой новой строке.
Пример:
     123567
     1
     2
     3
     4
     5
     6
     7
'''
число = 984757
строка = str(число)
список = list(строка)
for i in список :
    print(i)

#Задачи на циклы и оператор условия------
#----------------------------------------
'''
(!!!Подсказка на следующие 5 задач - превратите число в строку, а потом работайте с строкой)
Задача 6
Найти сумму цифр числа.
    Пример:
    254314
    Сумма цифр числа - 19(2+5+4+3+1+4)
'''
число = 984757
строка = str(число)
список = list(строка)
sum = 0
for i in список :
    sum = sum + int(i)
print('сумма чисел числа ',число, ' = ', sum)

'''
Задача 7
Найти произведение цифр числа.
    Пример:
    254314
    Произведение цифр числа - 480(2*5*4*3*1*4)
'''
число = 1123
строка = str(число)
список = list(строка)
res = 1
for i in список :
    res = res * int(i)
print('произведение чисел числа ',число, ' = ', res)

'''
Задача 8
Пользователь должен ввести число. Ваш код должен дать ответ на вопрос: есть ли среди цифр числа 5?
Если есть, код должен вывексти "Цифра 5 есть в числе", в противном случае вывести: "Цифры 5 нет в числе".
'''
print('Введите число')
число = int(input())
строка = str(число)
список = list(строка)
есть5 = 0
for i in список :
    if int(i) == 5 : есть5 = есть5 + 1
if есть5 > 0 : print("Цифра 5 есть в числе")
else: print("Цифры 5 нет в числе")
'''
Задача 9
Найти максимальную цифру в числе
Пример:
    354359688
    'Цифра - 9 максимальная в числе 354359688'
'''
print('Введите число')
число = int(input())
строка = str(число)
список = list(строка)
максимум = int(список[0])
for i in список :
    if int(i) > максимум : максимум = int(i)
print('Цифра ', максимум, 'максимальная в числе', число)

'''
Задача 10
Найти количество цифр 5 в числе
    Пример:
        543231235643
        'В числе 2 5-ки.'
'''
print('Введите число')
число = int(input())
строка = str(число)
список = list(строка)
есть5 = 0
for i in список :
    if int(i) == 5 : есть5 = есть5 + 1
print("В числе ", число, ' 5 есть',есть5, 'раз' )
